Microchip-MPLAB-Harmony/reference_apps/apps/sam_e51_cnano/ble_fitness_tracker/firmware/src/packs/ATSAME51J20A_DFP/component/rtc.h
#define RTC_MODE2_ALARM1_SECOND_Pos           _U_(0)                                               /**< (RTC_MODE2_ALARM1) Second Position */
#define RTC_MODE2_ALARM1_SECOND_Msk           (_U_(0x3F) << RTC_MODE2_ALARM1_SECOND_Pos)           /**< (RTC_MODE2_ALARM1) Second Mask */
#define RTC_MODE2_ALARM1_SECOND(value)        (RTC_MODE2_ALARM1_SECOND_Msk & ((value) << RTC_MODE2_ALARM1_SECOND_Pos))
#define RTC_MODE2_ALARM1_MINUTE_Pos           _U_(6)                                               /**< (RTC_MODE2_ALARM1) Minute Position */
#define RTC_MODE2_ALARM1_MINUTE_Msk           (_U_(0x3F) << RTC_MODE2_ALARM1_MINUTE_Pos)           /**< (RTC_MODE2_ALARM1) Minute Mask */
#define RTC_MODE2_ALARM1_MINUTE(value)        (RTC_MODE2_ALARM1_MINUTE_Msk & ((value) << RTC_MODE2_ALARM1_MINUTE_Pos))
#define RTC_MODE2_ALARM1_HOUR_Pos             _U_(12)                                              /**< (RTC_MODE2_ALARM1) Hour Position */
#define RTC_MODE2_ALARM1_HOUR_Msk             (_U_(0x1F) << RTC_MODE2_ALARM1_HOUR_Pos)             /**< (RTC_MODE2_ALARM1) Hour Mask */
#define RTC_MODE2_ALARM1_HOUR(value)          (RTC_MODE2_ALARM1_HOUR_Msk & ((value) << RTC_MODE2_ALARM1_HOUR_Pos))
#define   RTC_MODE2_ALARM1_HOUR_AM_Val        _U_(0x0)                                             /**< (RTC_MODE2_ALARM1) Morning hour  */
#define   RTC_MODE2_ALARM1_HOUR_PM_Val        _U_(0x10)                                            /**< (RTC_MODE2_ALARM1) Afternoon hour  */
#define RTC_MODE2_ALARM1_HOUR_AM              (RTC_MODE2_ALARM1_HOUR_AM_Val << RTC_MODE2_ALARM1_HOUR_Pos) /**< (RTC_MODE2_ALARM1) Morning hour Position  */
#define RTC_MODE2_ALARM1_HOUR_PM              (RTC_MODE2_ALARM1_HOUR_PM_Val << RTC_MODE2_ALARM1_HOUR_Pos) /**< (RTC_MODE2_ALARM1) Afternoon hour Position  */
#define RTC_MODE2_ALARM1_DAY_Pos              _U_(17)                                              /**< (RTC_MODE2_ALARM1) Day Position */
#define RTC_MODE2_ALARM1_DAY_Msk              (_U_(0x1F) << RTC_MODE2_ALARM1_DAY_Pos)              /**< (RTC_MODE2_ALARM1) Day Mask */
#define RTC_MODE2_ALARM1_DAY(value)           (RTC_MODE2_ALARM1_DAY_Msk & ((value) << RTC_MODE2_ALARM1_DAY_Pos))
#define RTC_MODE2_ALARM1_MONTH_Pos            _U_(22)                                              /**< (RTC_MODE2_ALARM1) Month Position */
#define RTC_MODE2_ALARM1_MONTH_Msk            (_U_(0xF) << RTC_MODE2_ALARM1_MONTH_Pos)             /**< (RTC_MODE2_ALARM1) Month Mask */
#define RTC_MODE2_ALARM1_MONTH(value)         (RTC_MODE2_ALARM1_MONTH_Msk & ((value) << RTC_MODE2_ALARM1_MONTH_Pos))
#define RTC_MODE2_ALARM1_YEAR_Pos             _U_(26)                                              /**< (RTC_MODE2_ALARM1) Year Position */
#define RTC_MODE2_ALARM1_YEAR_Msk             (_U_(0x3F) << RTC_MODE2_ALARM1_YEAR_Pos)             /**< (RTC_MODE2_ALARM1) Year Mask */
#define RTC_MODE2_ALARM1_YEAR(value)          (RTC_MODE2_ALARM1_YEAR_Msk & ((value) << RTC_MODE2_ALARM1_YEAR_Pos))
#define RTC_MODE2_ALARM1_Msk                  _U_(0xFFFFFFFF)                                      /**< (RTC_MODE2_ALARM1) Register Mask  */


/* -------- RTC_MODE2_MASK1 : (RTC Offset: 0x2C) (R/W 8) MODE2_ALARM Alarm n Mask -------- */
#define RTC_MODE2_MASK1_RESETVALUE            _U_(0x00)                                            /**<  (RTC_MODE2_MASK1) MODE2_ALARM Alarm n Mask  Reset Value */

#define RTC_MODE2_MASK1_SEL_Pos               _U_(0)                                               /**< (RTC_MODE2_MASK1) Alarm Mask Selection Position */
#define RTC_MODE2_MASK1_SEL_Msk               (_U_(0x7) << RTC_MODE2_MASK1_SEL_Pos)                /**< (RTC_MODE2_MASK1) Alarm Mask Selection Mask */
#define RTC_MODE2_MASK1_SEL(value)            (RTC_MODE2_MASK1_SEL_Msk & ((value) << RTC_MODE2_MASK1_SEL_Pos))
#define   RTC_MODE2_MASK1_SEL_OFF_Val         _U_(0x0)                                             /**< (RTC_MODE2_MASK1) Alarm Disabled  */
#define   RTC_MODE2_MASK1_SEL_SS_Val          _U_(0x1)                                             /**< (RTC_MODE2_MASK1) Match seconds only  */
#define   RTC_MODE2_MASK1_SEL_MMSS_Val        _U_(0x2)                                             /**< (RTC_MODE2_MASK1) Match seconds and minutes only  */
#define   RTC_MODE2_MASK1_SEL_HHMMSS_Val      _U_(0x3)                                             /**< (RTC_MODE2_MASK1) Match seconds, minutes, and hours only  */
#define   RTC_MODE2_MASK1_SEL_DDHHMMSS_Val    _U_(0x4)                                             /**< (RTC_MODE2_MASK1) Match seconds, minutes, hours, and days only  */
#define   RTC_MODE2_MASK1_SEL_MMDDHHMMSS_Val  _U_(0x5)                                             /**< (RTC_MODE2_MASK1) Match seconds, minutes, hours, days, and months only  */
#define   RTC_MODE2_MASK1_SEL_YYMMDDHHMMSS_Val _U_(0x6)                                             /**< (RTC_MODE2_MASK1) Match seconds, minutes, hours, days, months, and years  */
#define RTC_MODE2_MASK1_SEL_OFF               (RTC_MODE2_MASK1_SEL_OFF_Val << RTC_MODE2_MASK1_SEL_Pos) /**< (RTC_MODE2_MASK1) Alarm Disabled Position  */
#define RTC_MODE2_MASK1_SEL_SS                (RTC_MODE2_MASK1_SEL_SS_Val << RTC_MODE2_MASK1_SEL_Pos) /**< (RTC_MODE2_MASK1) Match seconds only Position  */
#define RTC_MODE2_MASK1_SEL_MMSS              (RTC_MODE2_MASK1_SEL_MMSS_Val << RTC_MODE2_MASK1_SEL_Pos) /**< (RTC_MODE2_MASK1) Match seconds and minutes only Position  */
#define RTC_MODE2_MASK1_SEL_HHMMSS            (RTC_MODE2_MASK1_SEL_HHMMSS_Val << RTC_MODE2_MASK1_SEL_Pos) /**< (RTC_MODE2_MASK1) Match seconds, minutes, and hours only Position  */
#define RTC_MODE2_MASK1_SEL_DDHHMMSS          (RTC_MODE2_MASK1_SEL_DDHHMMSS_Val << RTC_MODE2_MASK1_SEL_Pos) /**< (RTC_MODE2_MASK1) Match seconds, minutes, hours, and days only Position  */
#define RTC_MODE2_MASK1_SEL_MMDDHHMMSS        (RTC_MODE2_MASK1_SEL_MMDDHHMMSS_Val << RTC_MODE2_MASK1_SEL_Pos) /**< (RTC_MODE2_MASK1) Match seconds, minutes, hours, days, and months only Position  */
#define RTC_MODE2_MASK1_SEL_YYMMDDHHMMSS      (RTC_MODE2_MASK1_SEL_YYMMDDHHMMSS_Val << RTC_MODE2_MASK1_SEL_Pos) /**< (RTC_MODE2_MASK1) Match seconds, minutes, hours, days, months, and years Position  */
#define RTC_MODE2_MASK1_Msk                   _U_(0x07)                                            /**< (RTC_MODE2_MASK1) Register Mask  */


/* -------- RTC_TAMPCTRL : (RTC Offset: 0x60) (R/W 32) Tamper Control -------- */
#define RTC_TAMPCTRL_RESETVALUE               _U_(0x00)                                            /**<  (RTC_TAMPCTRL) Tamper Control  Reset Value */

#define RTC_TAMPCTRL_IN0ACT_Pos               _U_(0)                                               /**< (RTC_TAMPCTRL) Tamper Input 0 Action Position */
#define RTC_TAMPCTRL_IN0ACT_Msk               (_U_(0x3) << RTC_TAMPCTRL_IN0ACT_Pos)                /**< (RTC_TAMPCTRL) Tamper Input 0 Action Mask */
#define RTC_TAMPCTRL_IN0ACT(value)            (RTC_TAMPCTRL_IN0ACT_Msk & ((value) << RTC_TAMPCTRL_IN0ACT_Pos))
#define   RTC_TAMPCTRL_IN0ACT_OFF_Val         _U_(0x0)                                             /**< (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN0ACT_WAKE_Val        _U_(0x1)                                             /**< (RTC_TAMPCTRL) Wake without timestamp  */
#define   RTC_TAMPCTRL_IN0ACT_CAPTURE_Val     _U_(0x2)                                             /**< (RTC_TAMPCTRL) Capture timestamp  */
#define   RTC_TAMPCTRL_IN0ACT_ACTL_Val        _U_(0x3)                                             /**< (RTC_TAMPCTRL) Compare IN0 to OUT  */
#define RTC_TAMPCTRL_IN0ACT_OFF               (RTC_TAMPCTRL_IN0ACT_OFF_Val << RTC_TAMPCTRL_IN0ACT_Pos) /**< (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN0ACT_WAKE              (RTC_TAMPCTRL_IN0ACT_WAKE_Val << RTC_TAMPCTRL_IN0ACT_Pos) /**< (RTC_TAMPCTRL) Wake without timestamp Position  */
#define RTC_TAMPCTRL_IN0ACT_CAPTURE           (RTC_TAMPCTRL_IN0ACT_CAPTURE_Val << RTC_TAMPCTRL_IN0ACT_Pos) /**< (RTC_TAMPCTRL) Capture timestamp Position  */
#define RTC_TAMPCTRL_IN0ACT_ACTL              (RTC_TAMPCTRL_IN0ACT_ACTL_Val << RTC_TAMPCTRL_IN0ACT_Pos) /**< (RTC_TAMPCTRL) Compare IN0 to OUT Position  */
#define RTC_TAMPCTRL_IN1ACT_Pos               _U_(2)                                               /**< (RTC_TAMPCTRL) Tamper Input 1 Action Position */
#define RTC_TAMPCTRL_IN1ACT_Msk               (_U_(0x3) << RTC_TAMPCTRL_IN1ACT_Pos)                /**< (RTC_TAMPCTRL) Tamper Input 1 Action Mask */
#define RTC_TAMPCTRL_IN1ACT(value)            (RTC_TAMPCTRL_IN1ACT_Msk & ((value) << RTC_TAMPCTRL_IN1ACT_Pos))
#define   RTC_TAMPCTRL_IN1ACT_OFF_Val         _U_(0x0)                                             /**< (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN1ACT_WAKE_Val        _U_(0x1)                                             /**< (RTC_TAMPCTRL) Wake without timestamp  */
#define   RTC_TAMPCTRL_IN1ACT_CAPTURE_Val     _U_(0x2)                                             /**< (RTC_TAMPCTRL) Capture timestamp  */
#define   RTC_TAMPCTRL_IN1ACT_ACTL_Val        _U_(0x3)                                             /**< (RTC_TAMPCTRL) Compare IN1 to OUT  */
#define RTC_TAMPCTRL_IN1ACT_OFF               (RTC_TAMPCTRL_IN1ACT_OFF_Val << RTC_TAMPCTRL_IN1ACT_Pos) /**< (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN1ACT_WAKE              (RTC_TAMPCTRL_IN1ACT_WAKE_Val << RTC_TAMPCTRL_IN1ACT_Pos) /**< (RTC_TAMPCTRL) Wake without timestamp Position  */
#define RTC_TAMPCTRL_IN1ACT_CAPTURE           (RTC_TAMPCTRL_IN1ACT_CAPTURE_Val << RTC_TAMPCTRL_IN1ACT_Pos) /**< (RTC_TAMPCTRL) Capture timestamp Position  */
#define RTC_TAMPCTRL_IN1ACT_ACTL              (RTC_TAMPCTRL_IN1ACT_ACTL_Val << RTC_TAMPCTRL_IN1ACT_Pos) /**< (RTC_TAMPCTRL) Compare IN1 to OUT Position  */
#define RTC_TAMPCTRL_IN2ACT_Pos               _U_(4)                                               /**< (RTC_TAMPCTRL) Tamper Input 2 Action Position */
#define RTC_TAMPCTRL_IN2ACT_Msk               (_U_(0x3) << RTC_TAMPCTRL_IN2ACT_Pos)                /**< (RTC_TAMPCTRL) Tamper Input 2 Action Mask */
#define RTC_TAMPCTRL_IN2ACT(value)            (RTC_TAMPCTRL_IN2ACT_Msk & ((value) << RTC_TAMPCTRL_IN2ACT_Pos))
#define   RTC_TAMPCTRL_IN2ACT_OFF_Val         _U_(0x0)                                             /**< (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN2ACT_WAKE_Val        _U_(0x1)                                             /**< (RTC_TAMPCTRL) Wake without timestamp  */
#define   RTC_TAMPCTRL_IN2ACT_CAPTURE_Val     _U_(0x2)                                             /**< (RTC_TAMPCTRL) Capture timestamp  */
#define   RTC_TAMPCTRL_IN2ACT_ACTL_Val        _U_(0x3)                                             /**< (RTC_TAMPCTRL) Compare IN2 to OUT  */
#define RTC_TAMPCTRL_IN2ACT_OFF               (RTC_TAMPCTRL_IN2ACT_OFF_Val << RTC_TAMPCTRL_IN2ACT_Pos) /**< (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN2ACT_WAKE              (RTC_TAMPCTRL_IN2ACT_WAKE_Val << RTC_TAMPCTRL_IN2ACT_Pos) /**< (RTC_TAMPCTRL) Wake without timestamp Position  */
#define RTC_TAMPCTRL_IN2ACT_CAPTURE           (RTC_TAMPCTRL_IN2ACT_CAPTURE_Val << RTC_TAMPCTRL_IN2ACT_Pos) /**< (RTC_TAMPCTRL) Capture timestamp Position  */
#define RTC_TAMPCTRL_IN2ACT_ACTL              (RTC_TAMPCTRL_IN2ACT_ACTL_Val << RTC_TAMPCTRL_IN2ACT_Pos) /**< (RTC_TAMPCTRL) Compare IN2 to OUT Position  */
#define RTC_TAMPCTRL_IN3ACT_Pos               _U_(6)                                               /**< (RTC_TAMPCTRL) Tamper Input 3 Action Position */
#define RTC_TAMPCTRL_IN3ACT_Msk               (_U_(0x3) << RTC_TAMPCTRL_IN3ACT_Pos)                /**< (RTC_TAMPCTRL) Tamper Input 3 Action Mask */
#define RTC_TAMPCTRL_IN3ACT(value)            (RTC_TAMPCTRL_IN3ACT_Msk & ((value) << RTC_TAMPCTRL_IN3ACT_Pos))
#define   RTC_TAMPCTRL_IN3ACT_OFF_Val         _U_(0x0)                                             /**< (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN3ACT_WAKE_Val        _U_(0x1)                                             /**< (RTC_TAMPCTRL) Wake without timestamp  */
#define   RTC_TAMPCTRL_IN3ACT_CAPTURE_Val     _U_(0x2)                                             /**< (RTC_TAMPCTRL) Capture timestamp  */
#define   RTC_TAMPCTRL_IN3ACT_ACTL_Val        _U_(0x3)                                             /**< (RTC_TAMPCTRL) Compare IN3 to OUT  */
#define RTC_TAMPCTRL_IN3ACT_OFF               (RTC_TAMPCTRL_IN3ACT_OFF_Val << RTC_TAMPCTRL_IN3ACT_Pos) /**< (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN3ACT_WAKE              (RTC_TAMPCTRL_IN3ACT_WAKE_Val << RTC_TAMPCTRL_IN3ACT_Pos) /**< (RTC_TAMPCTRL) Wake without timestamp Position  */
#define RTC_TAMPCTRL_IN3ACT_CAPTURE           (RTC_TAMPCTRL_IN3ACT_CAPTURE_Val << RTC_TAMPCTRL_IN3ACT_Pos) /**< (RTC_TAMPCTRL) Capture timestamp Position  */
#define RTC_TAMPCTRL_IN3ACT_ACTL              (RTC_TAMPCTRL_IN3ACT_ACTL_Val << RTC_TAMPCTRL_IN3ACT_Pos) /**< (RTC_TAMPCTRL) Compare IN3 to OUT Position  */
#define RTC_TAMPCTRL_IN4ACT_Pos               _U_(8)                                               /**< (RTC_TAMPCTRL) Tamper Input 4 Action Position */
#define RTC_TAMPCTRL_IN4ACT_Msk               (_U_(0x3) << RTC_TAMPCTRL_IN4ACT_Pos)                /**< (RTC_TAMPCTRL) Tamper Input 4 Action Mask */
#define RTC_TAMPCTRL_IN4ACT(value)            (RTC_TAMPCTRL_IN4ACT_Msk & ((value) << RTC_TAMPCTRL_IN4ACT_Pos))
#define   RTC_TAMPCTRL_IN4ACT_OFF_Val         _U_(0x0)                                             /**< (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN4ACT_WAKE_Val        _U_(0x1)                                             /**< (RTC_TAMPCTRL) Wake without timestamp  */
#define   RTC_TAMPCTRL_IN4ACT_CAPTURE_Val     _U_(0x2)                                             /**< (RTC_TAMPCTRL) Capture timestamp  */
#define   RTC_TAMPCTRL_IN4ACT_ACTL_Val        _U_(0x3)                                             /**< (RTC_TAMPCTRL) Compare IN4 to OUT  */
#define RTC_TAMPCTRL_IN4ACT_OFF               (RTC_TAMPCTRL_IN4ACT_OFF_Val << RTC_TAMPCTRL_IN4ACT_Pos) /**< (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN4ACT_WAKE              (RTC_TAMPCTRL_IN4ACT_WAKE_Val << RTC_TAMPCTRL_IN4ACT_Pos) /**< (RTC_TAMPCTRL) Wake without timestamp Position  */
#define RTC_TAMPCTRL_IN4ACT_CAPTURE           (RTC_TAMPCTRL_IN4ACT_CAPTURE_Val << RTC_TAMPCTRL_IN4ACT_Pos) /**< (RTC_TAMPCTRL) Capture timestamp Position  */
#define RTC_TAMPCTRL_IN4ACT_ACTL              (RTC_TAMPCTRL_IN4ACT_ACTL_Val << RTC_TAMPCTRL_IN4ACT_Pos) /**< (RTC_TAMPCTRL) Compare IN4 to OUT Position  */
#define RTC_TAMPCTRL_TAMLVL0_Pos              _U_(16)                                              /**< (RTC_TAMPCTRL) Tamper Level Select 0 Position */
#define RTC_TAMPCTRL_TAMLVL0_Msk              (_U_(0x1) << RTC_TAMPCTRL_TAMLVL0_Pos)               /**< (RTC_TAMPCTRL) Tamper Level Select 0 Mask */
#define RTC_TAMPCTRL_TAMLVL0(value)           (RTC_TAMPCTRL_TAMLVL0_Msk & ((value) << RTC_TAMPCTRL_TAMLVL0_Pos))
#define RTC_TAMPCTRL_TAMLVL1_Pos              _U_(17)                                              /**< (RTC_TAMPCTRL) Tamper Level Select 1 Position */
#define RTC_TAMPCTRL_TAMLVL1_Msk              (_U_(0x1) << RTC_TAMPCTRL_TAMLVL1_Pos)               /**< (RTC_TAMPCTRL) Tamper Level Select 1 Mask */
#define RTC_TAMPCTRL_TAMLVL1(value)           (RTC_TAMPCTRL_TAMLVL1_Msk & ((value) << RTC_TAMPCTRL_TAMLVL1_Pos))
#define RTC_TAMPCTRL_TAMLVL2_Pos              _U_(18)                                              /**< (RTC_TAMPCTRL) Tamper Level Select 2 Position */
#define RTC_TAMPCTRL_TAMLVL2_Msk              (_U_(0x1) << RTC_TAMPCTRL_TAMLVL2_Pos)               /**< (RTC_TAMPCTRL) Tamper Level Select 2 Mask */
#define RTC_TAMPCTRL_TAMLVL2(value)           (RTC_TAMPCTRL_TAMLVL2_Msk & ((value) << RTC_TAMPCTRL_TAMLVL2_Pos))
#define RTC_TAMPCTRL_TAMLVL3_Pos              _U_(19)                                              /**< (RTC_TAMPCTRL) Tamper Level Select 3 Position */
#define RTC_TAMPCTRL_TAMLVL3_Msk              (_U_(0x1) << RTC_TAMPCTRL_TAMLVL3_Pos)               /**< (RTC_TAMPCTRL) Tamper Level Select 3 Mask */
#define RTC_TAMPCTRL_TAMLVL3(value)           (RTC_TAMPCTRL_TAMLVL3_Msk & ((value) << RTC_TAMPCTRL_TAMLVL3_Pos))
#define RTC_TAMPCTRL_TAMLVL4_Pos              _U_(20)                                              /**< (RTC_TAMPCTRL) Tamper Level Select 4 Position */
#define RTC_TAMPCTRL_TAMLVL4_Msk              (_U_(0x1) << RTC_TAMPCTRL_TAMLVL4_Pos)               /**< (RTC_TAMPCTRL) Tamper Level Select 4 Mask */
#define RTC_TAMPCTRL_TAMLVL4(value)           (RTC_TAMPCTRL_TAMLVL4_Msk & ((value) << RTC_TAMPCTRL_TAMLVL4_Pos))
#define RTC_TAMPCTRL_DEBNC0_Pos               _U_(24)                                              /**< (RTC_TAMPCTRL) Debouncer Enable 0 Position */
#define RTC_TAMPCTRL_DEBNC0_Msk               (_U_(0x1) << RTC_TAMPCTRL_DEBNC0_Pos)                /**< (RTC_TAMPCTRL) Debouncer Enable 0 Mask */
#define RTC_TAMPCTRL_DEBNC0(value)            (RTC_TAMPCTRL_DEBNC0_Msk & ((value) << RTC_TAMPCTRL_DEBNC0_Pos))
#define RTC_TAMPCTRL_DEBNC1_Pos               _U_(25)                                              /**< (RTC_TAMPCTRL) Debouncer Enable 1 Position */
#define RTC_TAMPCTRL_DEBNC1_Msk               (_U_(0x1) << RTC_TAMPCTRL_DEBNC1_Pos)                /**< (RTC_TAMPCTRL) Debouncer Enable 1 Mask */
#define RTC_TAMPCTRL_DEBNC1(value)            (RTC_TAMPCTRL_DEBNC1_Msk & ((value) << RTC_TAMPCTRL_DEBNC1_Pos))
#define RTC_TAMPCTRL_DEBNC2_Pos               _U_(26)                                              /**< (RTC_TAMPCTRL) Debouncer Enable 2 Position */
#define RTC_TAMPCTRL_DEBNC2_Msk               (_U_(0x1) << RTC_TAMPCTRL_DEBNC2_Pos)                /**< (RTC_TAMPCTRL) Debouncer Enable 2 Mask */
#define RTC_TAMPCTRL_DEBNC2(value)            (RTC_TAMPCTRL_DEBNC2_Msk & ((value) << RTC_TAMPCTRL_DEBNC2_Pos))
#define RTC_TAMPCTRL_DEBNC3_Pos               _U_(27)                                              /**< (RTC_TAMPCTRL) Debouncer Enable 3 Position */
#define RTC_TAMPCTRL_DEBNC3_Msk               (_U_(0x1) << RTC_TAMPCTRL_DEBNC3_Pos)                /**< (RTC_TAMPCTRL) Debouncer Enable 3 Mask */
#define RTC_TAMPCTRL_DEBNC3(value)            (RTC_TAMPCTRL_DEBNC3_Msk & ((value) << RTC_TAMPCTRL_DEBNC3_Pos))
#define RTC_TAMPCTRL_DEBNC4_Pos               _U_(28)                                              /**< (RTC_TAMPCTRL) Debouncer Enable 4 Position */
#define RTC_TAMPCTRL_DEBNC4_Msk               (_U_(0x1) << RTC_TAMPCTRL_DEBNC4_Pos)                /**< (RTC_TAMPCTRL) Debouncer Enable 4 Mask */
#define RTC_TAMPCTRL_DEBNC4(value)            (RTC_TAMPCTRL_DEBNC4_Msk & ((value) << RTC_TAMPCTRL_DEBNC4_Pos))
#define RTC_TAMPCTRL_Msk                      _U_(0x1F1F03FF)                                      /**< (RTC_TAMPCTRL) Register Mask  */

#define RTC_TAMPCTRL_TAMLVL_Pos               _U_(16)                                              /**< (RTC_TAMPCTRL Position) Tamper Level Select x */
#define RTC_TAMPCTRL_TAMLVL_Msk               (_U_(0x1F) << RTC_TAMPCTRL_TAMLVL_Pos)               /**< (RTC_TAMPCTRL Mask) TAMLVL */
#define RTC_TAMPCTRL_TAMLVL(value)            (RTC_TAMPCTRL_TAMLVL_Msk & ((value) << RTC_TAMPCTRL_TAMLVL_Pos)) 
#define RTC_TAMPCTRL_DEBNC_Pos                _U_(24)                                              /**< (RTC_TAMPCTRL Position) Debouncer Enable 4 */
#define RTC_TAMPCTRL_DEBNC_Msk                (_U_(0x1F) << RTC_TAMPCTRL_DEBNC_Pos)                /**< (RTC_TAMPCTRL Mask) DEBNC */
#define RTC_TAMPCTRL_DEBNC(value)             (RTC_TAMPCTRL_DEBNC_Msk & ((value) << RTC_TAMPCTRL_DEBNC_Pos)) 

/* -------- RTC_MODE0_TIMESTAMP : (RTC Offset: 0x64) ( R/ 32) MODE0 Timestamp -------- */
#define RTC_MODE0_TIMESTAMP_RESETVALUE        _U_(0x00)                                            /**<  (RTC_MODE0_TIMESTAMP) MODE0 Timestamp  Reset Value */

#define RTC_MODE0_TIMESTAMP_COUNT_Pos         _U_(0)                                               /**< (RTC_MODE0_TIMESTAMP) Count Timestamp Value Position */
#define RTC_MODE0_TIMESTAMP_COUNT_Msk         (_U_(0xFFFFFFFF) << RTC_MODE0_TIMESTAMP_COUNT_Pos)   /**< (RTC_MODE0_TIMESTAMP) Count Timestamp Value Mask */
#define RTC_MODE0_TIMESTAMP_COUNT(value)      (RTC_MODE0_TIMESTAMP_COUNT_Msk & ((value) << RTC_MODE0_TIMESTAMP_COUNT_Pos))
#define RTC_MODE0_TIMESTAMP_Msk               _U_(0xFFFFFFFF)                                      /**< (RTC_MODE0_TIMESTAMP) Register Mask  */


/* -------- RTC_MODE1_TIMESTAMP : (RTC Offset: 0x64) ( R/ 32) MODE1 Timestamp -------- */
#define RTC_MODE1_TIMESTAMP_RESETVALUE        _U_(0x00)                                            /**<  (RTC_MODE1_TIMESTAMP) MODE1 Timestamp  Reset Value */

#define RTC_MODE1_TIMESTAMP_COUNT_Pos         _U_(0)                                               /**< (RTC_MODE1_TIMESTAMP) Count Timestamp Value Position */
#define RTC_MODE1_TIMESTAMP_COUNT_Msk         (_U_(0xFFFF) << RTC_MODE1_TIMESTAMP_COUNT_Pos)       /**< (RTC_MODE1_TIMESTAMP) Count Timestamp Value Mask */
#define RTC_MODE1_TIMESTAMP_COUNT(value)      (RTC_MODE1_TIMESTAMP_COUNT_Msk & ((value) << RTC_MODE1_TIMESTAMP_COUNT_Pos))
#define RTC_MODE1_TIMESTAMP_Msk               _U_(0x0000FFFF)                                      /**< (RTC_MODE1_TIMESTAMP) Register Mask  */


/* -------- RTC_MODE2_TIMESTAMP : (RTC Offset: 0x64) ( R/ 32) MODE2 Timestamp -------- */
#define RTC_MODE2_TIMESTAMP_RESETVALUE        _U_(0x00)                                            /**<  (RTC_MODE2_TIMESTAMP) MODE2 Timestamp  Reset Value */

